beasts = list()

beasts.append({
    "Имя": "Лосяш",
    "Цвет": "Шафрановый",
    "Серии": ["Герой Плутона", "Бабочка", "Долгая рыбалка"]
})

beasts.append({
    "Имя": "Копатыч",
    "Цвет": "Коричневый",
    "Серии": ["Долгая рыбалка", "Кулинария", "Танцор Диско"]
})

#добавление нового персонажа
beasts.append({
    "Имя": "Бараш",
    "Цвет": "Розовый",
    "Серии": ["1 апреля", "Подарок судьбы", "Прощай, Бараш"]
})

#добавление нового ключа и любимых фраз персонажей
beasts[1]["Любимая фраза"]="Укуси меня пчела!"
beasts[0]["Любимая фраза"]="Феноменально!"

#замена цвета Копатыча на Светло-коричневый
beasts[1]["Цвет"]="Светло-коричневый"

#удаление серии "Герой Плутона" из списка серий Лосяша
beasts[0]["Серии"]=["Бабочка", "Долгая рыбалка"]

#cоздание второй структуры, идентичной первой, удаление оттуда записи про Копатыча 
#так чтобы оригинальная структура не поменялась
beasts2 = beasts.copy()
del beasts2[1]

#подсчет количества записанных смешариков
print(f"Количество записанных смешариков = {len(beasts)}")

print(beasts)


print(beasts2)